// Auto-generated by d2-mod-toolkit auto_discover.py
// Generated: 2026-03-21T20:37:49.741877
// Structs: 11
#pragma once
#include <windows.h>

struct Inventory;
struct ItemData;
struct ItemPath;
struct Level;
struct MonsterData;
struct Path;
struct PlayerData;
struct Room1;
struct Room2;
struct StatList;
struct UnitAny;

struct Inventory { // size 0x30
    DWORD dwSignature; // 0x00
    BYTE _1[4]; // 0x04
    UnitAny* pOwner; // 0x08
    UnitAny* pFirstItem; // 0x0C
    UnitAny* pLastItem; // 0x10
    BYTE _2[12]; // 0x14
    UnitAny* pCursorItem; // 0x20
    BYTE _3[4]; // 0x24
    DWORD dwItemCount; // 0x28
}; // 0x30

struct ItemData { // size 0x90
    DWORD dwQuality; // 0x00
    BYTE _1[8]; // 0x04
    DWORD dwItemFlags; // 0x0C
    BYTE _2[24]; // 0x10
    DWORD dwFileIndex; // 0x28
    BYTE _3[24]; // 0x2C
    BYTE BodyLocation; // 0x44
    BYTE ItemLocation; // 0x45
    BYTE _4[35]; // 0x46
    BYTE NodePage; // 0x69 1=storage,2=belt,3=equipped
}; // 0x90

struct ItemPath { // size 0x14
    BYTE _1[12]; // 0x00
    DWORD dwPosX; // 0x0C grid X / belt slot
    DWORD dwPosY; // 0x10 grid Y
}; // 0x14

struct Level { // size 0x230
    BYTE _1[4]; // 0x00
    BYTE _2[4]; // 0x04
    BYTE _3[248]; // 0x08
    DWORD dwLevelNo; // 0x1D0 area ID
    BYTE _4[88]; // 0x1D4
    Level* pNextLevel; // 0x22C
}; // 0x230

struct MonsterData { // size 0x60
    BYTE _1[22]; // 0x00
    BYTE fBoss; // 0x16 bit0=boss,bit1=champion,bit2=minion
}; // 0x60

struct Path { // size 0x64
    WORD xOffset; // 0x00
    WORD xPos; // 0x02
    WORD yOffset; // 0x04
    WORD yPos; // 0x06
    BYTE _1[8]; // 0x08
    WORD xTarget; // 0x10
    WORD yTarget; // 0x12
    BYTE _2[8]; // 0x14
    Room1* pRoom1; // 0x1C
    Room1* pRoomUnk; // 0x20
    BYTE _3[12]; // 0x24
    UnitAny* pUnit; // 0x30
}; // 0x64

struct PlayerData { // size 0x170
    char szName[16]; // 0x00 character name
}; // 0x170

struct Room1 { // size 0x80
    BYTE _1[4]; // 0x00
    void* pRoomsNear; // 0x04
    BYTE _2[16]; // 0x08
    Room2* pRoom2; // 0x18
    BYTE _3[20]; // 0x1C
    UnitAny* pUnitFirst; // 0x30 first unit in room
    BYTE _4[44]; // 0x34
    Room1* pRoomNext; // 0x60
}; // 0x80

struct Room2 { // size 0x50
    BYTE _1[4]; // 0x00
    BYTE _2[28]; // 0x04
    Level* pLevel; // 0x20
}; // 0x50

struct StatList { // size 0x40
    BYTE _1[4]; // 0x00
    UnitAny* pUnit; // 0x04
    DWORD dwUnitType; // 0x08
    DWORD dwUnitId; // 0x0C
    BYTE _2[20]; // 0x10
    void* pStat; // 0x24
    WORD wStatCount1; // 0x28
    WORD wSize; // 0x2A
    StatList* pPrevLink; // 0x2C
    BYTE _3[4]; // 0x30
    StatList* pPrev; // 0x34
    BYTE _4[4]; // 0x38
    StatList* pNext; // 0x3C
}; // 0x40

struct UnitAny { // size 0xEC
    DWORD dwType; // 0x00 0=Player,1=Monster,2=Object,3=Missile,4=Item,5=Tile
    DWORD dwTxtFileNo; // 0x04 class/item/monster ID
    BYTE _1[4]; // 0x08
    DWORD dwUnitId; // 0x0C unique unit ID
    DWORD dwMode; // 0x10 animation mode (0=death,12=dead)
    void* pData; // 0x14 PlayerData/ItemData/MonsterData/ObjectData
    DWORD dwAct; // 0x18
    Act* pAct; // 0x1C
    DWORD dwSeed; // 0x20
    BYTE _2[4]; // 0x28
    Path* pPath; // 0x2C
    BYTE _3[44]; // 0x30
    StatList* pStats; // 0x5C
    Inventory* pInventory; // 0x60
    BYTE _4[40]; // 0x64
    WORD wX; // 0x8C
    WORD wY; // 0x8E
    BYTE _5[4]; // 0x90
    DWORD dwOwnerType; // 0x94
    DWORD dwOwnerId; // 0x98
    BYTE _6[12]; // 0x9C
    Info* pInfo; // 0xA8 skills
    BYTE _7[52]; // 0xAC
    UnitAny* pChangedNext; // 0xE0
    UnitAny* pRoomNext; // 0xE4
    UnitAny* pListNext; // 0xE8
}; // 0xEC

